       IDENTIFICATION DIVISION.
       PROGRAM-ID. "FILEOUTPUT".
       AUTHOR. K4RUK4M1.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MY-FILE ASSIGN TO "fileoutput.txt"
           ORGANIZATION IS SEQUENTIAL
           ACCESS IS SEQUENTIAL
           FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MY-FILE.
       01  MY-FILE-REG.
           05 MY-FILE-TEXT PIC X(6).

       WORKING-STORAGE SECTION.
       01  FILE-STATUS PIC 99.

       PROCEDURE DIVISION.
       
       MAIN.
           DISPLAY "STARTING PROGRAM: FILEOUTPUT".
           OPEN OUTPUT MY-FILE.
           MOVE "PRUEBA" TO MY-FILE-TEXT.
           WRITE MY-FILE-REG.
           CLOSE MY-FILE.
           STOP RUN.
