       IDENTIFICATION DIVISION.
       PROGRAM-ID. "HELLOWORLD".
       AUTHOR. LOBSANG BARRIGA.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
           DISPLAY "HELLO, WORLD!".
       STOP RUN.

