      ******************************************************************
      * helloworld.cbl
      ******************************************************************
      * This program outputs "HELLO, WORLD!".
      * Use it as an example, for reference or to check a
      * working environment.
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. "HELLOWORLD".
       AUTHOR. K4RUK4M1.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
      *    The DISPLAY verb outputs text to the screen.
           DISPLAY "HELLO, WORLD!".
       STOP RUN.

