       IDENTIFICATION DIVISION.
       PROGRAM-ID. "SQUARE".
       AUTHOR. LOBSANG BARRIGA.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "+ + + + +".
           DISPLAY "+       +".
           DISPLAY "+       +".
           DISPLAY "+       +".
           DISPLAY "+ + + + +".
           STOP RUN.
