       IDENTIFICATION DIVISION.
       PROGRAM-ID. "USERINPUT".
       AUTHOR. LOBSANG BARRIGA.

       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       
       WORKING-STORAGE SECTION.
       01 USER-INPUT PIC A(20).

       PROCEDURE DIVISION.
           DISPLAY "ENTER SOME TEXT (20 CHARS MAX): " WITH NO ADVANCING.
           ACCEPT USER-INPUT.
           DISPLAY "THE ENTERED TEXT IS: " USER-INPUT.
       STOP RUN.
